In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import numpy as np

### READING BOOKS DATASET

In [2]:
books=pd.read_csv('BX-Books.csv',sep=';',encoding='latin-1',error_bad_lines=False)
books.head()

C:\Users\ps109\AppData\Local\Temp\ipykernel_13872\2856410529.py:1: FutureWarning: The error_bad_lines argument has been deprecated and will be removed in a future version. Use on_bad_lines in the future.


  books=pd.read_csv('BX-Books.csv',sep=';',encoding='latin-1',error_bad_lines=False)
b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'
b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'
C:\Users\ps109\AppData\Local\Temp\ipykernel_13872\2856410529.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  books=pd.read_csv('BX-Books.csv',sep=';',encoding='latin-1',error_bad_lines=False)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

#### LOOKING AT THE TOP OF BOOK DATAFRAME

In [3]:
books=books[['ISBN','Book-Title','Book-Author','Year-Of-Publication','Publisher']]
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

#### TAKING THE FIVE COLUMN DATAFRAME ONLY FROM BOOKS DATFRAME AND PASSING IT ON BOOKS DATAFRAME AGAIN

In [4]:
books.columns=['isbn','title','author','year','publisher']

In [5]:
books.head()

,isbn,title,author,year,publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

### CREATING USERS DATASET

In [6]:
users=pd.read_csv('BX-Users.csv',encoding='latin-1',sep=';')

In [7]:
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [8]:
users.columns=['id','location','age']

In [9]:
users.head(1)

   id            location  age
0   1  nyc, new york, usa  NaN

#### CREATING RATINGS DATAFRAME

In [10]:
ratings=pd.read_csv('BX-Book-Ratings.csv',encoding='latin-1',sep=';')

In [11]:
ratings.head(1)

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0

In [12]:
ratings.columns=['id','isbn','rating']
ratings.head(1)

       id        isbn  rating
0  276725  034545104X       0

##### PRINTING THE SHAPES OF ALL THESE DATAFRAMES

In [13]:
print('the books data shape is :', books.shape)
print('the users data shape is :', users.shape)
print('the ratings data shape is :', ratings.shape)

the books data shape is : (271360, 5)
the users data shape is : (278858, 3)
the ratings data shape is : (1149780, 3)

#### WE WILL TAKE ONLY THOSE USERS WHO HAVE RATED MIN. 200 BOOKS
#### WE WILL TAKE ONLY THOSE BOOKS WHO HAVE BEEN RATED BY 50 USERS

In [14]:
ratings['id'].value_counts()

11676     13602
198711     7550
153662     6109
98391      5891
35859      5850
          ...
116180        1
116166        1
116154        1
116137        1
276723        1
Name: id, Length: 105283, dtype: int64

##### CREATING THE DATAFRAME OF RATINGS VALUE COUNTS

In [15]:
users_ratings=ratings['id'].value_counts()

##### CREATING THE DATFRAME OF USERS WHO HAVE RATED ON 200 BOOKS AT LEAST

In [16]:
users_rat_200=users_ratings.loc[users_ratings>200]
users_rat_200.shape

(899,)

In [17]:
ratings=ratings[ratings['id'].isin(users_rat_200.index)]

In [18]:
ratings.shape

(526356, 3)

In [19]:
ratings.head()

          id        isbn  rating
1456  277427  002542730X      10
1457  277427  0026217457       0
1458  277427  003008685X       8
1459  277427  0030615321       0
1460  277427  0060002050       0

In [20]:
ratings_with_books=ratings.merge(books,on='isbn')
ratings_with_books.shape

(487671, 7)

In [21]:
number_rating=ratings_with_books.groupby('title')['rating'].count().reset_index()
number_rating.columns=['title','no of ratings']
number_rating.head()

                                               title  no of ratings
0   A Light in the Storm: The Civil War Diary of ...              2
1                              Always Have Popsicles              1
2               Apple Magic (The Collector's series)              1
3   Beyond IBM: Leadership Marketing and Finance ...              1
4   Clifford Visita El Hospital (Clifford El Gran...              1

In [22]:
number_rating.shape

(160269, 2)

In [23]:
final_rating=ratings_with_books.merge(number_rating,on='title')
final_rating.shape

(487671, 8)

#### CREATING THE DATAFRAME OF BOOKS HAVING NO OF RATINGS > 50 AND HAVING USERS WHO HAVE RATED ON MORE THAN 200 BOOKS

In [24]:
final_ratings=final_rating[final_rating['no of ratings']>=50]

In [25]:
final_ratings.shape

(61853, 8)

##### REMOVING DUPLICATES

In [26]:
final_ratings.drop_duplicates(['id','title'],inplace=True)
final_ratings.shape

C:\Users\ps109\AppData\Local\Temp\ipykernel_13872\4149211417.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final_ratings.drop_duplicates(['id','title'],inplace=True)

(59850, 8)

#### CREATING PIVOT TABLE (COLUMNS HAVING USER IDs AND ROWS HAVING TITLE OF THE BOOKS AND VALUES ARE THE RATINGS)

In [27]:
book_pivot=final_ratings.pivot_table(columns='id',index='title',values='rating')

In [28]:
book_pivot.head()

id,254,2276,2766,2977,3363,3757,4017,4385,6242,6251,...,274004,274061,274301,274308,274808,275970,277427,277478,277639,278418
title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN
1st to Die: A Novel,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2nd Chance,NaN,10.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN,0.0,NaN
4 Blondes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
84 Charing Cross Road,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,10.0,NaN,NaN,NaN,NaN

In [29]:
book_pivot.shape

(742, 888)

#### FILLING ALL THE NAN VALUES WITH 0

In [30]:
book_pivot.fillna(0,inplace=True)
book_pivot.head()

id,254,2276,2766,2977,3363,3757,4017,4385,6242,6251,...,274004,274061,274301,274308,274808,275970,277427,277478,277639,278418
title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1st to Die: A Novel,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2nd Chance,0.0,10.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4 Blondes,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
84 Charing Cross Road,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,10.0,0.0,0.0,0.0,0.0

### NEAREST NEIGHBORS

###### CREATING SPARSE MATRIX FROM SCIPY.SPARSE.CSR_MATRIX

In [31]:
from scipy.sparse import csr_matrix
book_sparse=csr_matrix(book_pivot)
type(book_sparse)

scipy.sparse._csr.csr_matrix

In [32]:
from sklearn.neighbors import NearestNeighbors
model=NearestNeighbors(algorithm='brute')

In [33]:
model.fit(book_sparse)

NearestNeighbors(algorithm='brute')

In [34]:
distances,suggestion=model.kneighbors(book_pivot.iloc[240,:].values.reshape(1,-1),n_neighbors=6)
distances

array([[ 0.        , 61.20457499, 68.78953409, 71.36525765, 73.17786551,
        74.57211275]])

In [35]:
book_pivot.index[240]

'Harry Potter and the Prisoner of Azkaban (Book 3)'

In [36]:
suggestion

array([[240, 238, 237, 241, 239, 184]], dtype=int64)

In [37]:
for i in range(len(suggestion)):
    print(book_pivot.index[suggestion[i]])

Index(['Harry Potter and the Prisoner of Azkaban (Book 3)',
       'Harry Potter and the Goblet of Fire (Book 4)',
       'Harry Potter and the Chamber of Secrets (Book 2)',
       'Harry Potter and the Sorcerer's Stone (Book 1)',
       'Harry Potter and the Order of the Phoenix (Book 5)', 'Exclusive'],
      dtype='object', name='title')

###### RECOMMENDING MOVIES BASED ON THE INDEX

In [38]:
book_pivot.index[237]

'Harry Potter and the Chamber of Secrets (Book 2)'

In [39]:
# np.where(book_pivot.index=='Animal Farm')[0][0]

### CREATING THE RECOMMEND FUNCTION

In [40]:
def recommend(book_name):
    idx=np.where(book_pivot.index==book_name)[0][0]
    distances,suggestion=model.kneighbors(book_pivot.iloc[idx,:].values.reshape(1,-1),n_neighbors=6)
    for i in range(len(suggestion)):
        if i==0:
            print('the suggestion are')
        if not i:
            print(book_pivot.index[suggestion[i]])

In [41]:
recommend('Animal Farm')

the suggestion are
Index(['Animal Farm', 'Exclusive', 'Jacob Have I Loved', 'Second Nature',
       'Pleading Guilty', 'No Safe Place'],
      dtype='object', name='title')